# ================================================================
# 开盲盒:一组n个玩偶,每个盒子等概率放一个,集齐n个期望买多少盒
# ================================================================
# 状态：dp[i]表示已经有i种玩偶的前提下，集齐n个需要买的盲盒数的期望
# 状态转移：dp[i] = 1(cost) + p(买到新的)*dp[i+1] + p(买到旧的)*dp[i]
# 起点: dp[n]=0, 终点:dp[0]=?
# ================================================================

n = 100

dp = [0 for _ in range(n+1)] # dp[i]表示已经有i种玩偶的前提下，集齐n个需要买的盲盒数的期望
dp[n] = 0.0

for i in range(n-1, -1, -1):
    dp[i] = dp[i+1] + (n/(n-i))
    # print(i, dp[i])
    
print(dp[0])
